rpcme/aws-mikroe-smarthome-pic32mz/smarthome-kit/microchip/harmony/v2.05/framework/peripheral/eth/processor/eth_p32mz2048efh100.h
PLIB_INLINE_API bool PLIB_ETH_ExistsReceiveWmarks(ETH_MODULE_ID index)
{
     return ETH_ExistsReceiveWmarks_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_InterruptSourceEnable(ETH_MODULE_ID index, ETH_INTERRUPT_SOURCES intmask)
{
     ETH_InterruptSourceEnable_Default(index, intmask);
}

PLIB_INLINE_API void PLIB_ETH_InterruptSourceDisable(ETH_MODULE_ID index, ETH_INTERRUPT_SOURCES intmask)
{
     ETH_InterruptSourceDisable_Default(index, intmask);
}

PLIB_INLINE_API bool PLIB_ETH_InterruptSourceIsEnabled(ETH_MODULE_ID index, ETH_INTERRUPT_SOURCES intmask)
{
     return ETH_InterruptSourceIsEnabled_Default(index, intmask);
}

PLIB_INLINE_API ETH_INTERRUPT_SOURCES PLIB_ETH_InterruptSourcesGet(ETH_MODULE_ID index)
{
     return ETH_InterruptSourcesGet_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_InterruptSet(ETH_MODULE_ID index, ETH_INTERRUPT_SOURCES intmask)
{
     ETH_InterruptSet_Default(index, intmask);
}

PLIB_INLINE_API void PLIB_ETH_InterruptClear(ETH_MODULE_ID index, ETH_INTERRUPT_SOURCES intmask)
{
     ETH_InterruptClear_Default(index, intmask);
}

PLIB_INLINE_API ETH_INTERRUPT_SOURCES PLIB_ETH_InterruptsGet(ETH_MODULE_ID index)
{
     return ETH_InterruptsGet_Default(index);
}

PLIB_INLINE_API bool PLIB_ETH_InterruptStatusGet(ETH_MODULE_ID index, ETH_INTERRUPT_SOURCES intmask)
{
     return ETH_InterruptStatusGet_Default(index, intmask);
}

PLIB_INLINE_API void PLIB_ETH_EventsEnableSet(ETH_MODULE_ID index, PLIB_ETH_EVENTS eEvents)
{
     ETH_EventsEnableSet_Default(index, eEvents);
}

PLIB_INLINE_API void PLIB_ETH_EventsEnableClr(ETH_MODULE_ID index, PLIB_ETH_EVENTS eEvents)
{
     ETH_EventsEnableClr_Default(index, eEvents);
}

PLIB_INLINE_API void PLIB_ETH_EventsEnableWrite(ETH_MODULE_ID index, PLIB_ETH_EVENTS eEvents)
{
     ETH_EventsEnableWrite_Default(index, eEvents);
}

PLIB_INLINE_API PLIB_ETH_EVENTS PLIB_ETH_EventsEnableGet(ETH_MODULE_ID index)
{
     return ETH_EventsEnableGet_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_EventsClr(ETH_MODULE_ID index, PLIB_ETH_EVENTS eEvents)
{
     ETH_EventsClr_Default(index, eEvents);
}

PLIB_INLINE_API PLIB_ETH_EVENTS PLIB_ETH_EventsGet(ETH_MODULE_ID index)
{
     return ETH_EventsGet_Default(index);
}

PLIB_INLINE_API bool PLIB_ETH_ExistsInterrupt(ETH_MODULE_ID index)
{
     return ETH_ExistsInterrupt_Default(index);
}

PLIB_INLINE_API uint8_t PLIB_ETH_RxPacketCountGet(ETH_MODULE_ID index)
{
     return ETH_RxPacketCountGet_Default(index);
}

PLIB_INLINE_API bool PLIB_ETH_EthernetIsBusy(ETH_MODULE_ID index)
{
     return ETH_EthernetIsBusy_Default(index);
}

PLIB_INLINE_API bool PLIB_ETH_TransmitIsBusy(ETH_MODULE_ID index)
{
     return ETH_TransmitIsBusy_Default(index);
}

PLIB_INLINE_API bool PLIB_ETH_ReceiveIsBusy(ETH_MODULE_ID index)
{
     return ETH_ReceiveIsBusy_Default(index);
}

PLIB_INLINE_API bool PLIB_ETH_ExistsEthernetControllerStatus(ETH_MODULE_ID index)
{
     return ETH_ExistsEthernetControllerStatus_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_RxOverflowCountClear(ETH_MODULE_ID index)
{
     ETH_RxOverflowCountClear_Default(index);
}

PLIB_INLINE_API uint16_t PLIB_ETH_RxOverflowCountGet(ETH_MODULE_ID index)
{
     return ETH_RxOverflowCountGet_Default(index);
}

PLIB_INLINE_API bool PLIB_ETH_ExistsReceiveOverflowCount(ETH_MODULE_ID index)
{
     return ETH_ExistsReceiveOverflowCount_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_FramesTxdOkCountClear(ETH_MODULE_ID index)
{
     ETH_FramesTxdOkCountClear_Default(index);
}

PLIB_INLINE_API uint16_t PLIB_ETH_FramesTxdOkCountGet(ETH_MODULE_ID index)
{
     return ETH_FramesTxdOkCountGet_Default(index);
}

PLIB_INLINE_API bool PLIB_ETH_ExistsFramesTransmittedOK(ETH_MODULE_ID index)
{
     return ETH_ExistsFramesTransmittedOK_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_SingleCollisionCountClear(ETH_MODULE_ID index)
{
     ETH_SingleCollisionCountClear_Default(index);
}

PLIB_INLINE_API uint16_t PLIB_ETH_SingleCollisionCountGet(ETH_MODULE_ID index)
{
     return ETH_SingleCollisionCountGet_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_MultipleCollisionCountClear(ETH_MODULE_ID index)
{
     ETH_MultipleCollisionCountClear_Default(index);
}

PLIB_INLINE_API uint16_t PLIB_ETH_MultipleCollisionCountGet(ETH_MODULE_ID index)
{
     return ETH_MultipleCollisionCountGet_Default(index);
}

PLIB_INLINE_API bool PLIB_ETH_ExistsCollisionCounts(ETH_MODULE_ID index)
{
     return ETH_ExistsCollisionCounts_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_FramesRxdOkCountClear(ETH_MODULE_ID index)
{
     ETH_FramesRxdOkCountClear_Default(index);
}

PLIB_INLINE_API uint16_t PLIB_ETH_FramesRxdOkCountGet(ETH_MODULE_ID index)
{
     return ETH_FramesRxdOkCountGet_Default(index);
}

PLIB_INLINE_API bool PLIB_ETH_ExistsFramexReceivedOK(ETH_MODULE_ID index)
{
     return ETH_ExistsFramexReceivedOK_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_FCSErrorCountClear(ETH_MODULE_ID index)
{
     ETH_FCSErrorCountClear_Default(index);
}

PLIB_INLINE_API uint16_t PLIB_ETH_FCSErrorCountGet(ETH_MODULE_ID index)
{
     return ETH_FCSErrorCountGet_Default(index);
}

PLIB_INLINE_API bool PLIB_ETH_ExistsFCSErrorCount(ETH_MODULE_ID index)
{
     return ETH_ExistsFCSErrorCount_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_AlignErrorCountClear(ETH_MODULE_ID index)
{
     ETH_AlignErrorCountClear_Default(index);
}

PLIB_INLINE_API uint16_t PLIB_ETH_AlignErrorCountGet(ETH_MODULE_ID index)
{
     return ETH_AlignErrorCountGet_Default(index);
}

PLIB_INLINE_API bool PLIB_ETH_ExistsAlignmentErrorCount(ETH_MODULE_ID index)
{
     return ETH_ExistsAlignmentErrorCount_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_MIIResetEnable(ETH_MODULE_ID index)
{
     ETH_MIIResetEnable_Default(index);
}

PLIB_INLINE_API void PLIB_ETH_MIIResetDisable(ETH_MODULE_ID index)
{
     ETH_MIIResetDisable_Default(index);
}

